; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	image0 - mode
	image1 - mode
	Star2 - direction
	Star4 - direction
	GroundStation1 - direction
	Star0 - direction
	Star3 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 158)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 137)
	(= (data Phenomenon5 infrared2) 133)
	(= (data Star6 infrared2) 258)
	(= (data Phenomenon7 infrared2) 16)
	(= (data Star8 infrared2) 188)
	(= (data Star9 infrared2) 31)
	(= (data Phenomenon5 image0) 137)
	(= (data Star6 image0) 124)
	(= (data Phenomenon7 image0) 99)
	(= (data Star8 image0) 47)
	(= (data Star9 image0) 42)
	(= (data Phenomenon5 image1) 11)
	(= (data Star6 image1) 253)
	(= (data Phenomenon7 image1) 9)
	(= (data Star8 image1) 185)
	(= (data Star9 image1) 219)
	(= (slew_time Star2 Star0) 45.46)
	(= (slew_time Star0 Star2) 45.46)
	(= (slew_time Star2 GroundStation1) 2.141)
	(= (slew_time GroundStation1 Star2) 2.141)
	(= (slew_time Star4 Star0) 4.92)
	(= (slew_time Star0 Star4) 4.92)
	(= (slew_time Star4 GroundStation1) 14.97)
	(= (slew_time GroundStation1 Star4) 14.97)
	(= (slew_time Star4 Star2) 14.97)
	(= (slew_time Star2 Star4) 14.97)
	(= (slew_time Star4 Star3) 3.9)
	(= (slew_time Star3 Star4) 3.9)
	(= (slew_time GroundStation1 Star0) 32.21)
	(= (slew_time Star0 GroundStation1) 32.21)
	(= (slew_time Star3 Star0) 4.508)
	(= (slew_time Star0 Star3) 4.508)
	(= (slew_time Star3 GroundStation1) 20.25)
	(= (slew_time GroundStation1 Star3) 20.25)
	(= (slew_time Star3 Star2) 76.45)
	(= (slew_time Star2 Star3) 76.45)
	(= (slew_time Phenomenon5 Star0) 12.19)
	(= (slew_time Star0 Phenomenon5) 12.19)
	(= (slew_time Phenomenon5 GroundStation1) 46.98)
	(= (slew_time GroundStation1 Phenomenon5) 46.98)
	(= (slew_time Phenomenon5 Star2) 67.96)
	(= (slew_time Star2 Phenomenon5) 67.96)
	(= (slew_time Phenomenon5 Star3) 1.708)
	(= (slew_time Star3 Phenomenon5) 1.708)
	(= (slew_time Phenomenon5 Star4) 77.01)
	(= (slew_time Star4 Phenomenon5) 77.01)
	(= (slew_time Star6 Star0) 37.79)
	(= (slew_time Star0 Star6) 37.79)
	(= (slew_time Star6 GroundStation1) 39.17)
	(= (slew_time GroundStation1 Star6) 39.17)
	(= (slew_time Star6 Star2) 54.08)
	(= (slew_time Star2 Star6) 54.08)
	(= (slew_time Star6 Star3) 54.21)
	(= (slew_time Star3 Star6) 54.21)
	(= (slew_time Star6 Star4) 23.33)
	(= (slew_time Star4 Star6) 23.33)
	(= (slew_time Star6 Phenomenon5) 23.04)
	(= (slew_time Phenomenon5 Star6) 23.04)
	(= (slew_time Phenomenon7 Star0) 14.16)
	(= (slew_time Star0 Phenomenon7) 14.16)
	(= (slew_time Phenomenon7 GroundStation1) 64.72)
	(= (slew_time GroundStation1 Phenomenon7) 64.72)
	(= (slew_time Phenomenon7 Star2) 38.44)
	(= (slew_time Star2 Phenomenon7) 38.44)
	(= (slew_time Phenomenon7 Star3) 51.55)
	(= (slew_time Star3 Phenomenon7) 51.55)
	(= (slew_time Phenomenon7 Star4) 19.51)
	(= (slew_time Star4 Phenomenon7) 19.51)
	(= (slew_time Phenomenon7 Phenomenon5) 15.2)
	(= (slew_time Phenomenon5 Phenomenon7) 15.2)
	(= (slew_time Phenomenon7 Star6) 52.63)
	(= (slew_time Star6 Phenomenon7) 52.63)
	(= (slew_time Star8 Star0) 1.048)
	(= (slew_time Star0 Star8) 1.048)
	(= (slew_time Star8 GroundStation1) 22.73)
	(= (slew_time GroundStation1 Star8) 22.73)
	(= (slew_time Star8 Star2) 24.9)
	(= (slew_time Star2 Star8) 24.9)
	(= (slew_time Star8 Star3) 50.69)
	(= (slew_time Star3 Star8) 50.69)
	(= (slew_time Star8 Star4) 82.63)
	(= (slew_time Star4 Star8) 82.63)
	(= (slew_time Star8 Phenomenon5) 67.9)
	(= (slew_time Phenomenon5 Star8) 67.9)
	(= (slew_time Star8 Star6) 44.38)
	(= (slew_time Star6 Star8) 44.38)
	(= (slew_time Star8 Phenomenon7) 44.01)
	(= (slew_time Phenomenon7 Star8) 44.01)
	(= (slew_time Star9 Star0) 28.83)
	(= (slew_time Star0 Star9) 28.83)
	(= (slew_time Star9 GroundStation1) 2.176)
	(= (slew_time GroundStation1 Star9) 2.176)
	(= (slew_time Star9 Star2) 11.99)
	(= (slew_time Star2 Star9) 11.99)
	(= (slew_time Star9 Star3) 44.78)
	(= (slew_time Star3 Star9) 44.78)
	(= (slew_time Star9 Star4) 73.45)
	(= (slew_time Star4 Star9) 73.45)
	(= (slew_time Star9 Phenomenon5) 52.89)
	(= (slew_time Phenomenon5 Star9) 52.89)
	(= (slew_time Star9 Star6) 0.8788)
	(= (slew_time Star6 Star9) 0.8788)
	(= (slew_time Star9 Phenomenon7) 86.2)
	(= (slew_time Phenomenon7 Star9) 86.2)
	(= (slew_time Star9 Star8) 14.25)
	(= (slew_time Star8 Star9) 14.25)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star8)
	(have_image Phenomenon5 infrared2)
	(have_image Phenomenon7 infrared2)
	(have_image Star8 infrared2)
	(have_image Star9 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 158 to 135.27, (fuel-used) from 0 to 22.73
   goals met: 1 of 5
2. (turn_to satellite1 star3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 137 to 86.31, (fuel-used) from 22.73 to 73.42
   goals met: 1 of 5
3. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 135.27 to 134.222, (fuel-used) from 73.42 to 74.468
   goals met: 0 of 5
4. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 5
5. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 5
6. (turn_to satellite1 phenomenon5 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 86.31 to 84.602, (fuel-used) from 74.468 to 76.176
   goals met: 0 of 5
7. (take_image satellite1 phenomenon5 instrument3 infrared2)
   added: (have_image phenomenon5 infrared2)
   changed: (data_capacity satellite1) from 1000 to 867, (data-stored) from 0 to 133
   goals met: 1 of 5
8. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 134.222 to 133.174, (fuel-used) from 76.176 to 77.224
   goals met: 2 of 5
9. (turn_to satellite1 phenomenon7 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon7)
   changed: (fuel satellite1) from 84.602 to 69.402, (fuel-used) from 77.224 to 92.424
   goals met: 2 of 5
10. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 133.174 to 132.126, (fuel-used) from 92.424 to 93.472
   goals met: 1 of 5
11. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 132.126 to 131.078, (fuel-used) from 93.472 to 94.52
   goals met: 2 of 5
12. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 131.078 to 130.03, (fuel-used) from 94.52 to 95.568
   goals met: 1 of 5
13. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 130.03 to 128.982, (fuel-used) from 95.568 to 96.616
   goals met: 2 of 5
14. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 128.982 to 127.934, (fuel-used) from 96.616 to 97.664
   goals met: 1 of 5
15. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 127.934 to 126.886, (fuel-used) from 97.664 to 98.712
   goals met: 2 of 5
16. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 126.886 to 125.838, (fuel-used) from 98.712 to 99.76
   goals met: 1 of 5
17. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 125.838 to 124.79, (fuel-used) from 99.76 to 100.808
   goals met: 2 of 5
18. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 124.79 to 123.742, (fuel-used) from 100.808 to 101.856
   goals met: 1 of 5
19. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 123.742 to 122.694, (fuel-used) from 101.856 to 102.904
   goals met: 2 of 5
20. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 122.694 to 121.646, (fuel-used) from 102.904 to 103.952
   goals met: 1 of 5
21. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 121.646 to 120.598, (fuel-used) from 103.952 to 105
   goals met: 2 of 5
22. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 120.598 to 119.55, (fuel-used) from 105 to 106.048
   goals met: 1 of 5
23. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 119.55 to 118.502, (fuel-used) from 106.048 to 107.096
   goals met: 2 of 5
24. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 118.502 to 117.454, (fuel-used) from 107.096 to 108.144
   goals met: 1 of 5
25. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 117.454 to 116.406, (fuel-used) from 108.144 to 109.192
   goals met: 2 of 5
26. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 116.406 to 115.358, (fuel-used) from 109.192 to 110.24
   goals met: 1 of 5
27. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 115.358 to 114.31, (fuel-used) from 110.24 to 111.288
   goals met: 2 of 5
28. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 114.31 to 113.262, (fuel-used) from 111.288 to 112.336
   goals met: 1 of 5
29. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 113.262 to 112.214, (fuel-used) from 112.336 to 113.384
   goals met: 2 of 5
30. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 112.214 to 111.166, (fuel-used) from 113.384 to 114.432
   goals met: 1 of 5
31. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 111.166 to 110.118, (fuel-used) from 114.432 to 115.48
   goals met: 2 of 5
32. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 110.118 to 109.07, (fuel-used) from 115.48 to 116.528
   goals met: 1 of 5
33. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 109.07 to 108.022, (fuel-used) from 116.528 to 117.576
   goals met: 2 of 5
34. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 5
35. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 108.022 to 106.974, (fuel-used) from 117.576 to 118.624
   goals met: 1 of 5
36. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 106.974 to 105.926, (fuel-used) from 118.624 to 119.672
   goals met: 2 of 5
37. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 105.926 to 104.878, (fuel-used) from 119.672 to 120.72
   goals met: 1 of 5
38. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 104.878 to 103.83, (fuel-used) from 120.72 to 121.768
   goals met: 2 of 5
39. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 103.83 to 102.782, (fuel-used) from 121.768 to 122.816
   goals met: 1 of 5
40. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 102.782 to 101.734, (fuel-used) from 122.816 to 123.864
   goals met: 2 of 5
41. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 101.734 to 100.686, (fuel-used) from 123.864 to 124.912
   goals met: 1 of 5
42. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 100.686 to 99.638, (fuel-used) from 124.912 to 125.96
   goals met: 2 of 5
43. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 99.638 to 98.59, (fuel-used) from 125.96 to 127.008
   goals met: 1 of 5
44. (turn_to satellite0 star4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 98.59 to 93.67, (fuel-used) from 127.008 to 131.928
   goals met: 1 of 5
45. (turn_to satellite0 star0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 93.67 to 88.75, (fuel-used) from 131.928 to 136.848
   goals met: 1 of 5
46. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 88.75 to 87.702, (fuel-used) from 136.848 to 137.896
   goals met: 2 of 5
47. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 87.702 to 86.654, (fuel-used) from 137.896 to 138.944
   goals met: 1 of 5
48. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 86.654 to 85.606, (fuel-used) from 138.944 to 139.992
   goals met: 2 of 5
49. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 85.606 to 84.558, (fuel-used) from 139.992 to 141.04
   goals met: 1 of 5
50. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 84.558 to 83.51, (fuel-used) from 141.04 to 142.088
   goals met: 2 of 5
51. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 83.51 to 82.462, (fuel-used) from 142.088 to 143.136
   goals met: 1 of 5
52. (turn_to satellite0 star4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 82.462 to 77.542, (fuel-used) from 143.136 to 148.056
   goals met: 1 of 5
53. (turn_to satellite0 star0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 77.542 to 72.622, (fuel-used) from 148.056 to 152.976
   goals met: 1 of 5
54. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 72.622 to 71.574, (fuel-used) from 152.976 to 154.024
   goals met: 2 of 5
55. (take_image satellite1 phenomenon7 instrument3 infrared2)
   added: (have_image phenomenon7 infrared2)
   changed: (data_capacity satellite1) from 867 to 851, (data-stored) from 133 to 149
   goals met: 3 of 5
56. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 71.574 to 70.526, (fuel-used) from 154.024 to 155.072
   goals met: 2 of 5
57. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 70.526 to 69.478, (fuel-used) from 155.072 to 156.12
   goals met: 3 of 5
58. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 69.478 to 68.43, (fuel-used) from 156.12 to 157.168
   goals met: 2 of 5
59. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 68.43 to 67.382, (fuel-used) from 157.168 to 158.216
   goals met: 3 of 5
60. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 67.382 to 66.334, (fuel-used) from 158.216 to 159.264
   goals met: 2 of 5
61. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 66.334 to 65.286, (fuel-used) from 159.264 to 160.312
   goals met: 3 of 5
62. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 65.286 to 64.238, (fuel-used) from 160.312 to 161.36
   goals met: 2 of 5
63. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 64.238 to 63.19, (fuel-used) from 161.36 to 162.408
   goals met: 3 of 5
64. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 63.19 to 62.142, (fuel-used) from 162.408 to 163.456
   goals met: 2 of 5
65. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 62.142 to 61.094, (fuel-used) from 163.456 to 164.504
   goals met: 3 of 5
66. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 61.094 to 60.046, (fuel-used) from 164.504 to 165.552
   goals met: 2 of 5
67. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 60.046 to 58.998, (fuel-used) from 165.552 to 166.6
   goals met: 3 of 5
68. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 58.998 to 57.95, (fuel-used) from 166.6 to 167.648
   goals met: 2 of 5
69. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 57.95 to 56.902, (fuel-used) from 167.648 to 168.696
   goals met: 3 of 5
70. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 56.902 to 55.854, (fuel-used) from 168.696 to 169.744
   goals met: 2 of 5
71. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 55.854 to 54.806, (fuel-used) from 169.744 to 170.792
   goals met: 3 of 5
72. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 54.806 to 53.758, (fuel-used) from 170.792 to 171.84
   goals met: 2 of 5
73. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 53.758 to 52.71, (fuel-used) from 171.84 to 172.888
   goals met: 3 of 5
74. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 52.71 to 51.662, (fuel-used) from 172.888 to 173.936
   goals met: 2 of 5
75. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 51.662 to 50.614, (fuel-used) from 173.936 to 174.984
   goals met: 3 of 5
76. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 50.614 to 49.566, (fuel-used) from 174.984 to 176.032
   goals met: 2 of 5
77. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 49.566 to 48.518, (fuel-used) from 176.032 to 177.08
   goals met: 3 of 5
78. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 48.518 to 47.47, (fuel-used) from 177.08 to 178.128
   goals met: 2 of 5
79. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 47.47 to 46.422, (fuel-used) from 178.128 to 179.176
   goals met: 3 of 5
80. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 46.422 to 45.374, (fuel-used) from 179.176 to 180.224
   goals met: 2 of 5
81. (turn_to satellite0 star4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 45.374 to 40.454, (fuel-used) from 180.224 to 185.144
   goals met: 2 of 5
82. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 5
83. (turn_to satellite0 star0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 40.454 to 35.534, (fuel-used) from 185.144 to 190.064
   goals met: 2 of 5
84. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 35.534 to 34.486, (fuel-used) from 190.064 to 191.112
   goals met: 3 of 5
85. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   changed: (fuel satellite0) from 34.486 to 20.236, (fuel-used) from 191.112 to 205.362
   goals met: 2 of 5
86. (take_image satellite0 star9 instrument0 infrared2)
   added: (have_image star9 infrared2)
   changed: (data_capacity satellite0) from 1000 to 969, (data-stored) from 149 to 180
   goals met: 3 of 5
87. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 20.236 to 5.986, (fuel-used) from 205.362 to 219.612
   goals met: 4 of 5
88. (take_image satellite0 star8 instrument0 infrared2)
   added: (have_image star8 infrared2)
   changed: (data_capacity satellite0) from 969 to 781, (data-stored) from 180 to 368
   goals met: 5 of 5
